apitests/validateTextKeyFromUserId.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" >
 <soap:Body>
  <validateTextKeyFromUserID_Key xmlns="https://secure.textkey.com/services/">
   <apiKey>PUT API KEY HERE</apiKey>
   <textKey> 4898697</textKey>
   <userID>BobSmithUID</userID>
   <isHashed>true</isHashed>
   <validationCode>537ED</validationCode>
  </validateTextKeyFromUserID_Key>
 </soap:Body>
</soap:Envelope>
